### Terraform Plan `01db782c4006b48c1bbc8bbc4cbb8e0a3c393bd5`
  <details>
  <summary>Show Plan</summary>
  
  ```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.domain.aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "codlr.store"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + zone_id             = (known after apply)
    }

  # module.private_route_table.aws_route_table.this will be updated in-place
  ~ resource "aws_route_table" "this" {
        id               = "rtb-0f5f86fcde4eca55f"
      ~ route            = [
          - {
              - cidr_block                 = "10.0.0.0/16"
              - gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "0.0.0.0/0"
                # (12 unchanged attributes hidden)
            },
          + {
              + cidr_block = "10.0.0.0/16"
              + gateway_id = "local"
            },
        ]
        tags             = {
            "Name" = "main-private-route-table"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```
  </details>
  
  *Binary plan file available as workflow artifact*